; модуль обработки карты
MODULE Cells

; --------------------------------------------------------------------------------------
; переводим pos в указатель на ячейку в массиве карты
; Вход: 
;     DE - pos,  D - x, E - y
; Выход: 
;     HL - указатель
; --------------------------------------------------------------------------------------
calc_pos:
  LD HL, #0000
  PUSH DE
  LD C,D; запоминаем posX в C
  LD A,E
  CP 00
  JR Z, .no_mul; если ноль по Y то не будем прибавлять ничего
  LD B,E; кидаем posY в B - по B будет автодекрементный цикл
  LD D,0
  LD E, mapSize
.mul_loop
  ADD HL,DE
  DJNZ .mul_loop
.no_mul
  POP DE
  LD E,D
  LD D,0
  ADD HL,DE; в HL у нас
  LD DE, MAP_SET
  ADD HL, DE
  RET

; --------------------------------------------------------------------------------------
; Установить ячейку на карте
; Вход:
;   DE - pos,  D - x, E - y
;   A - номер спрайта
; --------------------------------------------------------------------------------------
set:
  LD (.cur_spr), A
  CALL calc_pos
  MemSetBank mapBank
.cur_spr equ $+1
  LD (HL), #ff
  RET

ENDMODULE
